app/controllers/school_classes_controller.rb

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Science Updates"], ["id", 7]]